import type { VFC } from "react";

export const PrivacyPolicy: VFC = () => {
  return (
    <article className="px-4 pt-6 mx-auto mb-8 prose md:px-0">
      <h2>プライバシーポリシー</h2>
      <h3>個人情報保護方針</h3>
      <p>
        株式会社ウィズアス（以下「弊社」とします）は、個人情報が人格尊重の理念の下に慎重に取扱われるべきものであることに鑑み、個人情報を保護することが弊社の事業活動の基本であり、社会的責務であると認識し、以下の方針に基づき個人情報の保護に努めます。
      </p>
      <h4>個人情報に関する法令などの遵守</h4>
      <p>弊社は個人情報の保護に関する法令・ガイドラインを遵守して、ユーザーの個人情報を取扱います。</p>
      <h4>個人情報の収集、利用目的</h4>
      <p>
        弊社はユーザーのお名前、メールアドレスなどの個人情報を以下の目的で収集・利用いたします。なお、弊社は収集時の目的の範囲を超えて個人情報を利用する必要が生じた場合には、利用に先立ち、新たな目的をお知らせするものとします。
      </p>
      <ul>
        <li>本人確認のため</li>
        <li>サービスの提供のため</li>
        <li>ユーザーに対する必要事項の通知のため</li>
        <li>各種お問い合わせ対応、ユーザーサポートのため</li>
      </ul>
      <h4>個人情報の開示・訂正・利用停止・苦情・問い合わせ</h4>
      <p>
        ユーザーの個人情報の開示・訂正・利用停止などの手続き、及び、苦情・問い合わせなどにつきましては、お手数ですがお問い合わせ下さい。
      </p>
      <h4>プライバシーポリシーの改定等</h4>
      <p>
        弊社は、ユーザーへの事前通知することなく、このプライバシーポリシーを変更、修正または改定できるものとします。変更、修正または改定後のプライバシーポリシーは、弊社サイト又はサービスへの掲載をもって発効するものとします。
      </p>
      <p>2021 年 10 月 15 日 改定</p>
    </article>
  );
};
