import type { VFC } from "react";

export const Terms: VFC = () => {
  return (
    <article className="px-4 pt-6 mx-auto mb-8 prose md:px-0">
      <h3>利用規約</h3>
      <p>
        この規約は、株式会社ウィズアス（以下「弊社」とします。）が企画・運営する「Dualing」のご利用にあたって、利用規約（以下「本規約」といいます。）を定めたものです。Dualing
        （以下「本サービス」といいます。）の利用にあたっては、本規約に必ずご同意ください。登録ユーザーの皆さま（以下「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
      </p>
      <h4>第１条 適用</h4>
      <ol>
        <li>本規約は、ユーザーと弊社との間の本サービス の利用に関わる一切の関係に適用されるものとします。</li>
        <li>
          当社は本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下「個別規定」といいます。）をすることがあります。
          これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
        </li>
        <li>
          本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。
        </li>
      </ol>
      <h4>第２条 利用登録等</h4>
      <ol>
        <li>弊社は、本サービス を利用する各ユーザーを識別するための文字列を設定することがあります。</li>
        <li>
          ユーザーが 本サービス
          を利用するには、氏名、メールアドレス、パスワード等の登録、又は弊社が指定する第三者の発行する ID
          及びパスワードを求められることがあります。
        </li>
        <li>
          弊社は、本サービス
          を利用するにあたり登録した情報（以下「登録情報」といいます。）が以下に該当すると判断した場合、
          当該ユーザーによる登録を承認しないこと、当該登録を削除すること又は弊社が適切と判断する措置を講ずることがあります。
          <ul>
            <li>登録情報が第三者に嫌悪感を与える等の公序良俗に反する表現を含んでいる場合</li>
            <li>本規約に違反したことがある者からの利用登録である場合</li>
            <li>本規約に違反したことがある者からの招待による利用登録である場合</li>
            <li>第三者になりすますことを目的としている場合</li>
            <li>弊社の判断により､新規の利用を制限している場合</li>
            <li>前各号以外で、弊社が不適切な利用であると判断する場合</li>
          </ul>
        </li>
        <li>ユーザーは、登録情報に変更があった場合には、速やかに弊社所定の方法で変更の届出をするものとします。</li>
        <li>
          前項の届出がないことによって、第三者が不利益又は損害を被った場合は、当該ユーザーがその損害を賠償するものとします。
        </li>
      </ol>
      <h4>第３条 登録情報</h4>
      <ol>
        <li>ユーザーは、登録情報について、自己の責任の下、登録及び管理するものとします。</li>
        <li>
          弊社は、ユーザーが登録情報を失念、削除、不正確又は虚偽であったためにユーザーが被った不利益及び損害に関して、責任を負わないものとします。
        </li>
        <li>
          ユーザーは、弊社の事前の同意なく登録情報を第三者に利用させたり、貸与、譲渡、売買、質入、公開等をすることはできません。
        </li>
        <li>
          弊社は、登録情報によって 本サービス
          の利用があった場合、利用登録を行ったユーザー本人が利用したものと扱うことができ、当該利用によって生じた結果については、利用登録を行ったユーザー本人に帰属するものとします。
        </li>
        <li>
          ユーザーによる登録情報の管理が不十分であったために第三者が登録情報を不正使用した場合、ユーザーに不利益又は損害が生じても、弊社は責任を負わないものとします。
        </li>
        <li>
          前項の第三者の不正使用により、弊社又は第三者に損害が生じた場合、ユーザーは弊社及び損害を被った第三者に対し、損害を賠償するものとします。
        </li>
        <li>ユーザーは、登録情報を第三者に不正に使用される可能性がある場合は、速やかに弊社に通知するものとします。</li>
      </ol>
      <h4>第5条 禁止事項</h4>
      <ol>
        <li>
          ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
          <ul>
            <li>法令または公序良俗に違反する行為 犯罪行為に関連する行為</li>
            <li>本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
            <li>
              当社、ほかのユーザー、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
            </li>
            <li>本サービスによって得られた情報を商業的に利用する行為</li>
            <li>当社のサービスの運営を妨害するおそれのある行為</li>
            <li>不正アクセスをし、またはこれを試みる行為</li>
            <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
            <li>不正な目的を持って本サービスを利用する行為</li>
            <li>本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為</li>
            <li>他のユーザーに成りすます行為</li>
            <li>当社が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
            <li>面識のない異性との出会いを目的とした行為</li>
            <li>当社のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
            <li>その他、当社が不適切と判断する行為</li>
          </ul>
        </li>
        <li>
          弊社は、ユーザーが前項各号の行為を行った又は本規約に違反した場合、当該ユーザーの 本サービス
          の利用制限、利用停止、利用禁止、投稿情報の削除、登録情報の削除等の弊社が適切と判断する措置を行うことができるものとします。
        </li>
        <li>
          弊社は、本条第 1
          項各号の行為をユーザーが行うこと、又は受けることによって、他のユーザー又は第三者との間でトラブルが生じた場合、当該ユーザーは、自己の責任と費用においてこれを解決し、弊社は一切の責任を負わないものとします。この場合において、弊社又は第三者が何らかの損害を被ったときは、当該ユーザーは弊社及び当該第三者に対して損害の賠償をしなければならないものとします。
        </li>
      </ol>
      <h4>第6条 本サービスの提供の停止等</h4>
      <ol>
        <li>
          当社は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
          <ol>
            <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
            <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
            <li>コンピュータまたは通信回線等が事故により停止した場合</li>
            <li>その他、当社が本サービスの提供が困難と判断した場合</li>
          </ol>
        </li>
        <li>
          当社は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
        </li>
      </ol>
      <h4>第7条 利用制限および登録抹消</h4>
      <ol>
        <li>
          当社は、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限し、またはユーザーとしての登録を抹消することができるものとします。
          <ol>
            <li>本規約のいずれかの条項に違反した場合</li>
            <li>登録事項に虚偽の事実があることが判明した場合</li>
            <li>当社からの連絡に対し、一定期間返答がない場合</li>
            <li>本サービスについて、最終の利用から一定期間利用がない場合</li>
            <li>その他、当社が本サービスの利用を適当でないと判断した場合</li>
          </ol>
        </li>
        <li>当社は、本条に基づき当社が行った行為によりユーザーに生じた損害について、一切の責任を負いません。</li>
      </ol>
      <h4>第8条 退会</h4>
      <p>ユーザーは、当社の定める退会手続により、本サービスから退会できるものとします。</p>
      <h4>第9条 保証の否認および免責事項</h4>
      <ol>
        <li>
          当社
          は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
        </li>
        <li>
          弊社は、本サービス
          及び提携先又は広告主等を含む第三者のウェブサイトからのダウンロードやコンピューター・ウイルス感染等により発生した損害について、賠償する義務を一切負わないものとします。
        </li>
        <li>
          弊社は、本サービス
          に関するシステム障害、通信障害、停電、火災、自然災害、戦争、内乱、暴動、労働争議等の発生により 本サービス
          の正常な運営が不能となった場合であっても、それによってユーザーに生じた損害について、一切の責任を負わないものとします。
        </li>
        <li>
          弊社は、ユーザーが利用しているインターネット接続サービス及び端末の利用制限、中断、速度の低下、機能低下等によってユーザーに生じた損害について、一切の責任を負わないものとします。
        </li>
        <li>
          当社は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
        </li>
      </ol>
      <h4>第10条 サービス内容の変更等</h4>
      <p>
        当社は、ユーザーに通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。
      </p>
      <h4>第11条 利用規約の変更</h4>
      <p>
        当社は、必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお、本規約の変更後、本サービスの利用を開始した場合には、当該ユーザーは変更後の規約に同意したものとみなします。
      </p>
      <h4>第12条 個人情報の取扱い</h4>
      <p>
        当社は、本サービスの利用によって取得する個人情報については、当社「プライバシーポリシー」に従い適切に取り扱うものとします。
      </p>
      <h4>第13条 通知または連絡</h4>
      <p>
        ユーザーと当社との間の通知または連絡は、当社の定める方法によって行うものとします。当社は,ユーザーから,当社が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。
      </p>
      <h4>第14条 権利義務の譲渡の禁止</h4>
      <p>
        ユーザーは、当社の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
      </p>
      <h4>第15条 準拠法・裁判管轄</h4>
      <ol>
        <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
        <li>本サービスに関して紛争が生じた場合には、当社の所在地を管轄する裁判所を専属的合意管轄とします。</li>
      </ol>
      <p>2021 年 10 月 15 日 改定</p>
    </article>
  );
};
